qmk/qmk_firmware/tmk_core/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_Freescale/TARGET_MCU_K64F/TOOLCHAIN_ARM_STD/startup_MK64F12.s
; Reset Handler

Reset_Handler   PROC
                EXPORT  Reset_Handler             [WEAK]
                IMPORT  SystemInit
                IMPORT  __main
                LDR     R0, =SystemInit
                BLX     R0
                LDR     R0, =__main
                BX      R0
                ENDP


; Dummy Exception Handlers (infinite loops which can be modified)

NMI_Handler     PROC
                EXPORT  NMI_Handler               [WEAK]
                B       .
                ENDP
HardFault_Handler\
                PROC
                EXPORT  HardFault_Handler         [WEAK]
                B       .
                ENDP
MemManage_Handler\
                PROC
                EXPORT  MemManage_Handler         [WEAK]
                B       .
                ENDP
BusFault_Handler\
                PROC
                EXPORT  BusFault_Handler          [WEAK]
                B       .
                ENDP
UsageFault_Handler\
                PROC
                EXPORT  UsageFault_Handler        [WEAK]
                B       .
                ENDP
SVC_Handler     PROC
                EXPORT  SVC_Handler               [WEAK]
                B       .
                ENDP
DebugMon_Handler\
                PROC
                EXPORT  DebugMon_Handler          [WEAK]
                B       .
                ENDP
PendSV_Handler  PROC
                EXPORT  PendSV_Handler            [WEAK]
                B       .
                ENDP
SysTick_Handler PROC
                EXPORT  SysTick_Handler           [WEAK]
                B       .
                ENDP

Default_Handler PROC
                EXPORT     DMA0_IRQHandler  [WEAK]
                EXPORT     DMA1_IRQHandler  [WEAK]
                EXPORT     DMA2_IRQHandler  [WEAK]
                EXPORT     DMA3_IRQHandler  [WEAK]
                EXPORT     DMA4_IRQHandler  [WEAK]
                EXPORT     DMA5_IRQHandler  [WEAK]
                EXPORT     DMA6_IRQHandler  [WEAK]
                EXPORT     DMA7_IRQHandler  [WEAK]
                EXPORT     DMA8_IRQHandler  [WEAK]
                EXPORT     DMA9_IRQHandler  [WEAK]
                EXPORT     DMA10_IRQHandler  [WEAK]
                EXPORT     DMA11_IRQHandler  [WEAK]
                EXPORT     DMA12_IRQHandler  [WEAK]
                EXPORT     DMA13_IRQHandler  [WEAK]
                EXPORT     DMA14_IRQHandler  [WEAK]
                EXPORT     DMA15_IRQHandler  [WEAK]
                EXPORT     DMA_Error_IRQHandler   [WEAK]
                EXPORT     MCM_IRQHandler  [WEAK]
                EXPORT     FTFE_IRQHandler     [WEAK]
                EXPORT     Read_Collision_IRQHandler      [WEAK]
                EXPORT     LVD_LVW_IRQHandler       [WEAK]
                EXPORT     LLW_IRQHandler       [WEAK]
                EXPORT     Watchdog_IRQHandler  [WEAK]
                EXPORT     RNG_IRQHandler  [WEAK]
                EXPORT     I2C0_IRQHandler  [WEAK]
                EXPORT     I2C1_IRQHandler  [WEAK]
                EXPORT     SPI0_IRQHandler  [WEAK]
                EXPORT     SPI1_IRQHandler  [WEAK]
                EXPORT     I2S0_Tx_IRQHandler     [WEAK]
                EXPORT     I2S0_Rx_IRQHandler      [WEAK]
                EXPORT     UART0_LON_IRQHandler      [WEAK]
                EXPORT     UART0_RX_TX_IRQHandler      [WEAK]
                EXPORT     UART0_ERR_IRQHandler      [WEAK]
                EXPORT     UART1_RX_TX_IRQHandler      [WEAK]
                EXPORT     UART1_ERR_IRQHandler      [WEAK]
                EXPORT     UART2_RX_TX_IRQHandler      [WEAK]
                EXPORT     UART2_ERR_IRQHandler      [WEAK]
                EXPORT     UART3_RX_TX_IRQHandler      [WEAK]
                EXPORT     UART3_ERR_IRQHandler      [WEAK]
                EXPORT     ADC0_IRQHandler  [WEAK]
                EXPORT     CMP0_IRQHandler  [WEAK]
                EXPORT     CMP1_IRQHandler  [WEAK]
                EXPORT     FTM0_IRQHandler      [WEAK]
                EXPORT     FTM1_IRQHandler      [WEAK]
                EXPORT     FTM2_IRQHandler      [WEAK]
                EXPORT     CMT_IRQHandler      [WEAK]
                EXPORT     RTC_IRQHandler      [WEAK]
                EXPORT     RTC_Seconds_IRQHandler      [WEAK]
                EXPORT     PIT0_IRQHandler      [WEAK]
                EXPORT     PIT1_IRQHandler      [WEAK]
                EXPORT     PIT2_IRQHandler      [WEAK]
                EXPORT     PIT3_IRQHandler      [WEAK]
                EXPORT     PDB0_IRQHandler      [WEAK]
                EXPORT     USB0_IRQHandler  [WEAK]
                EXPORT     USBDCD_IRQHandler  [WEAK]
                EXPORT     Reserved71_IRQHandler      [WEAK]
                EXPORT     DAC0_IRQHandler     [WEAK]
                EXPORT     MCG_IRQHandler      [WEAK]
                EXPORT     LPTimer_IRQHandler    [WEAK]
                EXPORT     PORTA_IRQHandler      [WEAK]
                EXPORT     PORTB_IRQHandler      [WEAK]
                EXPORT     PORTC_IRQHandler      [WEAK]
                EXPORT     PORTD_IRQHandler      [WEAK]
                EXPORT     PORTE_IRQHandler      [WEAK]
                EXPORT     SWI_IRQHandler    [WEAK]
                EXPORT     SPI2_IRQHandler  [WEAK]
                EXPORT     UART4_RX_TX_IRQHandler  [WEAK]
                EXPORT     UART4_ERR_IRQHandler  [WEAK]
                EXPORT     UART5_RX_TX_IRQHandler  [WEAK]
                EXPORT     UART5_ERR_IRQHandler  [WEAK]
                EXPORT     CMP2_IRQHandler  [WEAK]
                EXPORT     FTM3_IRQHandler  [WEAK]
                EXPORT     DAC1_IRQHandler      [WEAK]
                EXPORT     ADC1_IRQHandler      [WEAK]
                EXPORT     I2C2_IRQHandler      [WEAK]
                EXPORT     CAN0_ORed_Message_buffer_IRQHandler   [WEAK]
                EXPORT     CAN0_Bus_Off_IRQHandler      [WEAK]
                EXPORT     CAN0_Error_IRQHandler      [WEAK]
                EXPORT     CAN0_Tx_Warning_IRQHandler  [WEAK]
                EXPORT     CAN0_Rx_Warning_IRQHandler  [WEAK]
                EXPORT     CAN0_Wake_Up_IRQHandler  [WEAK]
                EXPORT     SDHC_IRQHandler  [WEAK]
                EXPORT     ENET_1588_Timer_IRQHandler  [WEAK]
                EXPORT     ENET_Transmit_IRQHandler  [WEAK]
                EXPORT     ENET_Receive_IRQHandler  [WEAK]
                EXPORT     ENET_Error_IRQHandler  [WEAK]

